#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.application_gateway_itn.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-api-app-waf-01"
        name                = "io-p-itn-agw-api-app-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api.auth will be created
  + resource "azurerm_api_management_api" "auth" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Auth & Identity app-backend API"
      + display_name          = "Auth & Identity io-backend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-auth-api"
      + path                  = "api/auth"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-backend/50a0cf9b2831ac68f13a1098af837c7dba31e3dc/openapi/generated/api_auth.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_policy.auth will be created
  + resource "azurerm_api_management_api_policy" "auth" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-auth-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                    <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
                    <set-variable name="urlId" value="@{
                        Random rnd = new Random();
                        int urlId = rnd.Next(1, 3);
                        return urlId.ToString();
                    }" />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
                        </when>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
                        </when>
                        <otherwise>
                            <return-response>
                                <set-status code="500" reason="InternalServerError" />
                                <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
                                    <value>@{return Guid.NewGuid().ToString();}</value>
                                </set-header>
                                <set-body>A gateway-related error occurred while processing the request.</set-body>
                            </return-response>
                        </otherwise>
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_version_set.auth_v1 will be created
  + resource "azurerm_api_management_api_version_set" "auth_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "Auth & Identity app-backend v1"
      + id                  = (known after apply)
      + name                = "auth_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product.auth will be created
  + resource "azurerm_api_management_product" "auth" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IO A&I APIs"
      + display_name          = "IO Auth & Identity"
      + id                    = (known after apply)
      + product_id            = "io-auth"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_api.auth_auth will be created
  + resource "azurerm_api_management_product_api" "auth_auth" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-auth-api"
      + id                  = (known after apply)
      + product_id          = "io-auth"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_policy.auth will be created
  + resource "azurerm_api_management_product_policy" "auth" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-auth"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.application_gateway_weu.module.app_gw.azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway"
        name                              = "io-p-appgateway"
        tags                              = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (8 unchanged attributes hidden)

      ~ url_path_map {
            id                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map"
            name                                = "io-backend-path-based-rule-url-map"
            # (8 unchanged attributes hidden)

          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/api-gateway-platform-info"
              ~ name                        = "api-gateway-platform-info" -> "api-gateway-platform-auth"
              ~ paths                       = [
                  ~ "/info" -> "/api/auth/*",
                ]
              ~ rewrite_rule_set_name       = "rewrite-rule-set-api-app-rewrite-platform-legacy-root" -> "rewrite-rule-set-api-app"
                # (8 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/api-gateway-platform-ping"
              ~ name                        = "api-gateway-platform-ping" -> "api-gateway-platform-info"
              ~ paths                       = [
                  ~ "/api/v1/ping" -> "/info",
                ]
              ~ rewrite_rule_set_name       = "rewrite-rule-set-api-app-rewrite-platform-legacy" -> "rewrite-rule-set-api-app-rewrite-platform-legacy-root"
                # (8 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/api-gateway-platform-status"
              ~ name                        = "api-gateway-platform-status" -> "api-gateway-platform-ping"
              ~ paths                       = [
                  ~ "/api/v1/status" -> "/api/v1/ping",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/api-gateway-platform-trials"
              ~ name                        = "api-gateway-platform-trials" -> "api-gateway-platform-status"
              ~ paths                       = [
                  ~ "/api/v1/trials/*" -> "/api/v1/status",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
              ~ backend_address_pool_name   = "session-manager-app-address-pool" -> "platform-api-gateway-address-pool"
              ~ backend_http_settings_name  = "session-manager-app-http-settings" -> "platform-api-gateway-http-settings"
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/bpd-user"
              ~ name                        = "bpd-user" -> "api-gateway-platform-trials"
              ~ paths                       = [
                  ~ "/bpd/api/v1/user" -> "/api/v1/trials/*",
                ]
              ~ rewrite_rule_set_name       = "rewrite-rule-set-api-app" -> "rewrite-rule-set-api-app-rewrite-platform-legacy"
                # (6 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/fast-login"
              ~ name                        = "fast-login" -> "bpd-user"
              ~ paths                       = [
                  ~ "/api/v1/fast-login" -> "/bpd/api/v1/user",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
              ~ backend_address_pool_name   = "appbackend-app-address-pool" -> "session-manager-app-address-pool"
              ~ backend_http_settings_name  = "appbackend-app-http-settings" -> "session-manager-app-http-settings"
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/healthcheck"
              ~ name                        = "healthcheck" -> "fast-login"
              ~ paths                       = [
                  ~ "/healthcheck" -> "/api/v1/fast-login",
                ]
              ~ rewrite_rule_set_name       = "rewrite-rule-set-api-app-rewrite-to-session-manager" -> "rewrite-rule-set-api-app"
                # (6 unchanged attributes hidden)
            }
          ~ path_rule {
              ~ backend_address_pool_name   = "session-manager-app-address-pool" -> "appbackend-app-address-pool"
              ~ backend_http_settings_name  = "session-manager-app-http-settings" -> "appbackend-app-http-settings"
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/login"
              ~ name                        = "login" -> "healthcheck"
              ~ paths                       = [
                  ~ "/login" -> "/healthcheck",
                ]
              ~ rewrite_rule_set_name       = "rewrite-rule-set-api-app" -> "rewrite-rule-set-api-app-rewrite-to-session-manager"
                # (6 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/logout"
              ~ name                        = "logout" -> "login"
              ~ paths                       = [
                  ~ "/logout" -> "/login",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/metadata"
              ~ name                        = "metadata" -> "logout"
              ~ paths                       = [
                  ~ "/metadata" -> "/logout",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/nonce-fast-login"
              ~ name                        = "nonce-fast-login" -> "metadata"
              ~ paths                       = [
                  ~ "/api/v1/fast-login/nonce/generate" -> "/metadata",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/pagopa-user"
              ~ name                        = "pagopa-user" -> "nonce-fast-login"
              ~ paths                       = [
                  ~ "/pagopa/api/v1/user" -> "/api/v1/fast-login/nonce/generate",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/session"
              ~ name                        = "session" -> "pagopa-user"
              ~ paths                       = [
                  ~ "/api/v1/session" -> "/pagopa/api/v1/user",
                ]
                # (9 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/session-manager"
              ~ name                        = "session-manager" -> "session"
              ~ paths                       = [
                  ~ "/session-manager/*" -> "/api/v1/session",
                ]
              ~ rewrite_rule_set_name       = "rewrite-rule-set-api-app-remove-base-path-session-manager" -> "rewrite-rule-set-api-app"
                # (8 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/test-login"
              ~ name                        = "test-login" -> "session-manager"
              ~ paths                       = [
                  ~ "/test-login" -> "/session-manager/*",
                ]
              ~ rewrite_rule_set_name       = "rewrite-rule-set-api-app" -> "rewrite-rule-set-api-app-remove-base-path-session-manager"
                # (8 unchanged attributes hidden)
            }
          ~ path_rule {
                id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/urlPathMaps/io-backend-path-based-rule-url-map/pathRules/zendesk-user"
              ~ name                        = "zendesk-user" -> "test-login"
              ~ paths                       = [
                  ~ "/api/backend/zendesk/v1/jwt" -> "/test-login",
                ]
                # (9 unchanged attributes hidden)
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "zendesk-user"
              + paths                      = [
                  + "/api/backend/zendesk/v1/jwt",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }

            # (2 unchanged blocks hidden)
        }

        # (109 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.3"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_api_gateway_apim_itn.module.iam_adgroup_auth_admins.module.apim.azurerm_role_assignment.this["io-p-itn-common-rg-01|io-p-itn-platform-api-gateway-apim-01|owner"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + description                      = "Auth & Identity team admin group"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.platform_api_gateway_apim_itn.module.iam_adgroup_auth_infra_cd.module.apim.azurerm_role_assignment.this["io-p-itn-common-rg-01|io-p-itn-platform-api-gateway-apim-01|owner"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + description                      = "Auth & Identity team infra CD identity"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f1da2b10-2601-4937-8c8f-f61177b5b23d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 5 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
